#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_notify_teams_sns_publish will be created
  + resource "aws_iam_policy" "lambda_notify_teams_sns_publish" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yama-dev-env-lambda-notify-teams-sns-publish"
      + path   = "/yama-dev-env/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ap-northeast-1:521635626865:yama-dev-env"
                      + Sid      = "LambdaNotifyTeamsSnsPublish"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role_policy_attachment.notify_teams_sns_publish will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_sns_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "yama-dev-env-lambda-notify-teams"
    }

  # aws_lambda_function_event_invoke_config.notify_teams will be created
  + resource "aws_lambda_function_event_invoke_config" "notify_teams" {
      + function_name          = "yama-dev-env-notify-teams"
      + id                     = (known after apply)
      + maximum_retry_attempts = 2

      + destination_config {
          + on_failure {
              + destination = "arn:aws:sns:ap-northeast-1:521635626865:yama-dev-env"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
